Revit 2024 API
DimensionType.GetEqualityFormula Method
 Gets an ordered list of the entries in the equality formula definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public IList<DimensionEqualityLabelFormatting> GetEqualityFormula()
Visual Basic
Public Function GetEqualityFormula As IList(Of DimensionEqualityLabelFormatting)
Visual C++
public:
IList<DimensionEqualityLabelFormatting^>^ GetEqualityFormula()
Return Value
 An ordered list of the entries in the equality formula definition.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The given DimensionType cannot be assigned an equality formula as it is not continuous linear or angular.
See Also
DimensionType Class
Autodesk.Revit.DB Namespace